package JavaRush;
/* 10 процентов
Реализуйте метод addTenPercent, который увеличивает переданное целое число на 10%.
Исправьте ошибку в сигнатуре метода.
Подсказка: подумайте, какие у этого метода входные и выходные данные.
*/
public class d{
    public static double addTenPercent(int i) {
		double m = i + i*0.1;
    	return m;
         
        //напишите тут ваш код
    }

    public static void main(String[] args) {
        System.out.println(addTenPercent(10));
    }
}

